---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionISplitParallelFlange.BoltDiameter
source: html/639c6ced-03e9-e569-5f3c-1aa624d2204d.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionISplitParallelFlange.BoltDiameter Property

Maximum bolt hole diameter, in. (mm)

## Syntax (C#)
```csharp
public double BoltDiameter { get; set; }
```